Redmap_To_Fusion/Files/RM_FU/Fusion/TrialBalance/Request/Request - Copy.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:pub="http://xmlns.oracle.com/oxp/service/PublicReportService">
   <soap:Header/>
   <soap:Body>
      <pub:runReport>
         <pub:reportRequest>
            <pub:attributeFormat>csv</pub:attributeFormat>
			<!-- Flatten XML should always be false when we have XML type of output to display the XML tags as mentioned in BIP Data Model and display XML structure in as expected format -->
            <pub:flattenXML>true</pub:flattenXML>
            <pub:parameterNameValues>
				  <!--1st Parameter of BIP Report-->	
                  <pub:item>
                  <pub:name>P_ORG_NAME</pub:name>
                  <pub:values>
                      <pub:item>MSS Security Pty Limited</pub:item>
                  </pub:values>
                  </pub:item>
				  <pub:item>
                  <pub:name>P_LEDGER_NAME</pub:name>
                  <pub:values>
                      <pub:item>SIS AU PL</pub:item>
                  </pub:values>
                  </pub:item>
				  <pub:item>
                  <pub:name>P_PERIOD_NAME</pub:name>
                  <pub:values>
                      <pub:item>Feb-21</pub:item>
                  </pub:values>
                  </pub:item>
				  <pub:item>
                  <pub:name>P_PERIOD_TYPE</pub:name>
                  <pub:values>
                      <pub:item>PTD</pub:item>
                  </pub:values>
                  </pub:item>
				  <pub:item>
                  <pub:name>P_FIRST_PERIOD</pub:name>
                  <pub:values>
                      <pub:item></pub:item>
                  </pub:values>
                  </pub:item>
		   </pub:parameterNameValues>
            <pub:reportAbsolutePath>/Custom/Financials/Report/SIS Trial Balance Report.xdo</pub:reportAbsolutePath>
			<!-- Setting sizeOfDataChunkDownload to -1 will return the output to the calling client -->
            <pub:sizeOfDataChunkDownload>-1</pub:sizeOfDataChunkDownload>
         </pub:reportRequest>
      </pub:runReport>
   </soap:Body>
</soap:Envelope>